<script setup>
const sentences = [
    'کتابی که می‌جستید، در اینجا نیست',
    'صفحه‌ای که می‌خواهید یافت نشد',
    'کتابگردی بی‌پایان',
    'گم شدیم',
    'ما در اینجا نیستیم',
    'کتاب را گم کردید؟',
    'در صفحه‌ی اشتباهی هستی',
    'مراقب خودت باش هیچکس اینجا نیست',
];

const texts = [
    'چه شانس بدی! به نظر می رسد مکانش را فراموش کرده‌اید. نگران نباشید، برای پیدا کردن کتابخانه‌تان کمکتان میکنم... انگار شانس با شماست از دست‌نویسه‌هایتان خوشم می‌آید.',
    'از کجا شروع کنم؟ یک بار گفتم، یک بار دیگر می‌گویم: اگر صعود جنگلی را آغاز کردید، برای یافتن راه بازگشت تنها به یک  راه دسترسی دارید: صفحه اصلی. و دوستان، این فقط یک هشدار است!',
    'چیز عجیب! اینجا شهر گم‌شده کتاب‌هایی است که هرگز پیدا نخواهید کرد. حتی کهکشانهای دور هم از دسترسی خارج شده‌اند. اگر نمی‌خواهید یک گیاهفرسای چندتایی ترسناک را ملاقات کنید، بهتر است هر چه سریعتر از اینجا بروید!',
    'به گمراهی شما افتخار می‌کنیم! ماهواره‌ها می‌گویند کتابی که جستجو می‌کنید در دیگر ابعاد بیرون افتاده است. اما نترسید، قورباغه‌های سخنگو نزدیکتان هستند تا راهنماییتان کنند... با عرض پوزش پیشاپیش از صبر و حوصله‌تان سپاسگزاریم!',
    'شبانه‌روز در حال ماهی‌گیری برای گرفتن کتاب گم‌شده تان هستیم، اما نورپردازی ما متاسفانه بیش از حد قوی بود و باعث ربودن کتاب از چشم شد. بهتان قول می‌دهیم که برنامه دقیق‌تری برای شکار این کتابها اجرا خواهیم کرد... منتظریم!',
    'وارد داستانی بی‌پایان شده‌اید! چه جالب! اما به دوستانتان هشدار دهید، اگر یکبار دیگر گم شدید، احتمالاً به جاهایی می‌رسید که تا به حال ندیده‌اید. اما اگر نهایتاً این صفحه را پیدا کردید، حدس بزنید چه؟ آن‌جا هم یک معما منتظر شماست!',
    'دنیا چو کتابی است و کسانی که سیر نشوند به نیک و بد خیره‌ند. اما ای دوست، صفحه‌ای که دنبال می‌کنی چندان یافت نمی‌شود. عجب! روز می‌گذرد و تو را بهشتی به چشمان غیب می‌بینم. اما درواقع چشم‌پناهت در همه‌ی قصه‌ها وجود دارد.',
    'رقص کن، زمانی که زخم بر هم خورده‌ای. رقص کن، اگر پانسمان باز شده‌است. رقص کن در میان جنگ و جدل. رقص کن، وقتی خون می‌ریزی. رقص کن، زمانی که احساس آزادی مطلق می‌کنی.',
    'جهان شطرنجی است، و ما پیشه‌وران. اما ای دوست، پیاده‌ای که دنبال می‌کنی گم‌شده به نظر می‌رسد. نگران مباش، زیرا بازی هنوز پایان نیافته است و تو فرصت رسیدن به ابدیت را داری.',
];

var sentence = sentences[Math.floor(Math.random() * sentences.length)]
var text = texts[Math.floor(Math.random() * texts.length)]
</script>




<template>
    <section class="bg-white dark:bg-gray-900 h-5/6 flex items-center">
        <div class="py-8 px-4 mx-auto max-w-screen-xl lg:py-16 lg:px-6">
            <div class="flex items-center flex-col">
                <div class="mb-4 text-7xl tracking-tight font-extrabold lg:text-9xl text-maincolor">404</div>
                <div class="mb-4 text-3xl tracking-tight font-bold md:text-4xl">{{ sentence }}!</div>
                <div class="mb-4 text-lg font-light max-w-[60%]">{{ text }}</div>
                <RouterLink  class="bg-black text-white py-1 px-3 rounded-xl text-base mb-4" to="/"
                    data-aos="zoom-in"
                    data-aos-delay="250"
                    data-aos-duration="1000"
                    >برگشت به صفحه اصلی</RouterLink>
                <button  class="bg-black text-white py-1 px-3 rounded-xl text-base" @click="$router.go(-1)"
                    data-aos="zoom-in"
                    data-aos-delay="300"
                    data-aos-duration="1000"
                    >بازگشت به صفحه قبل</button>
            </div>   
        </div>
    </section>
</template>